package main

import (
	"fmt"
	"testing"
)

func ExampleSimple() {

	// output true
	oldOut := output
	output = false
	defer func() {
		output = oldOut
	}()

	es := []eigen{
		{𝜦: +2.0, 𝑿: []float64{+0.5714286, +0.1428572, +1.0000000}},
		{𝜦: -5.0, 𝑿: []float64{-0.6666667, -1.0000000, -1.0000000}},
		{𝜦: -1.0, 𝑿: []float64{+0.5773503, +0.5773503, +0.5773503}},
	}

	A := generator(es)
	MatrixPrint(A)
	output = true
	fmt.Println("Before")
	PrintEigens(es)
	output = false

	// initialize
	old := initialize
	initialize = func(x []float64) {
		for i := range x {
			x[i] = 1.0 + float64(i)
		}
	}
	defer func() {
		initialize = old
	}()

	// calculate
	e, err := exh(A)
	if err != nil {
		panic(err)
	}
	output = true
	fmt.Println("After")
	PrintEigens(e)
	output = false

	// compare
	output = true
	fmt.Println(compare(e, es))
	output = false

	// Output:
	// Before
	// ---     0 ---
	// 𝜦      = +2.0000000000e+00
	// 𝑿[  0] = +5.7142860000e-01
	// 𝑿[  1] = +1.4285720000e-01
	// 𝑿[  2] = +1.0000000000e+00
	// ---     1 ---
	// 𝜦      = -5.0000000000e+00
	// 𝑿[  0] = -6.6666670000e-01
	// 𝑿[  1] = -1.0000000000e+00
	// 𝑿[  2] = -1.0000000000e+00
	// ---     2 ---
	// 𝜦      = -1.0000000000e+00
	// 𝑿[  0] = +5.7735030000e-01
	// 𝑿[  1] = +5.7735030000e-01
	// 𝑿[  2] = +5.7735030000e-01
	// After
	// ---     0 ---
	// 𝜦      = -4.9999995141e+00
	// 𝑿[  0] = +6.6666668939e-01
	// 𝑿[  1] = +9.9999990456e-01
	// 𝑿[  2] = +1.0000000000e+00
	// ---     1 ---
	// 𝜦      = +1.9999997398e+00
	// 𝑿[  0] = +5.7142183122e-01
	// 𝑿[  1] = +1.4279607663e-01
	// 𝑿[  2] = +1.0000000000e+00
	// ---     2 ---
	// 𝜦      = -1.0000000000e+00
	// 𝑿[  0] = +9.9999999640e-01
	// 𝑿[  1] = +1.0000000000e+00
	// 𝑿[  2] = +9.9999992052e-01
	// Compare [  0,  1] is same
	// Compare [  1,  0] is same
	// Compare [  2,  2] is same
	// true
}

func TestSnippets(t *testing.T) {
	t.Run("Fadeev: page 334", func(t *testing.T) {
		e, err := exh([][]float64{
			{1.022551, 0.116069, -0.287028, -0.429969},
			{0.228401, 0.742521, -0.176368, -0.283720},
			{0.326141, 0.097221, 0.197209, -0.216487},
			{0.433864, 0.148965, -0.193686, 0.006472},
		})
		PrintEigens(e)
		if err != nil {
			t.Fatal(err)
		}

		t.Errorf("result is not checked")

		// [R,T]= spec([1.022551  0.116069  -0.287028  -0.429969 ; 0.228401  0.742521  -0.176368  -0.283720 ; 0.326141  0.097221  0.197209  -0.216487 ; 0.433864  0.148965  -0.193686  0.006472])
		//  T  =
		//
		//     0.2876392    0            0                         0
		//     0            0.3461482    0                         0
		//     0            0            0.6674828 + 8.991D-08i    0
		//     0            0            0                         0.6674828 - 8.991D-08i
		//  R  =
		//
		//   - 0.4803844    0.4256283  - 0.7074026               - 0.7074026
		//   - 0.3202569    0.2553766  - 0.3795747 + 0.1573849i  - 0.3795747 - 0.1573849i
		//   - 0.1601288    0.8512565  - 0.3652032 + 0.0187365i  - 0.3652032 - 0.0187365i
		//   - 0.8006405    0.1702519  - 0.4428447 + 0.0299782i  - 0.4428447 - 0.0299782i
	})
	t.Run("Fadeev: page 347", func(t *testing.T) {
		e, err := exh([][]float64{
			{1.00, 0.0, 1.00, 0.0},
			{1.00, 0.77777777777, 0.333333333333333, 0.3333333333333},
			{0.0, -0.02525252525, 0.555555555555555, -0.025252525252},
			{0.0, -0.88888888888, -8.64444444444444, 0.1111111111111},
		})
		PrintEigens(e)
		if err != nil {
			t.Fatal(err)
		}

		t.Errorf("result is not checked")
		// [P,O] = spec([1.00, 0.0, 1.00, 0.0 ;1.00, 0.77777777777, 0.333333333333333, 0.3333333333333 ;0.0, -0.02525252525, 0.555555555555555, -0.025252525252 ;0.0, -0.88888888888, -8.64444444444444, 0.1111111111111])
		// O  =
		//
		//     1.    0            0            0
		//     0     0.3333333    0            0
		//     0     0            0.4444444    0
		//     0     0            0            0.6666667
		//  P  =
		//
		//   - 0.3656362  - 0.0509677  - 0.0618765    0.1270457
		//   - 0.6581452  - 0.5402572  - 0.6256402    0.7876832
		//   - 4.600D-12    0.0339784    0.0343758  - 0.0423486
		//     0.6581452    0.8392675    0.7768938  - 0.6013495
	})
}

// func init() {
// 	output = flag.CommandLine.Lookup("test.v").Value.String() == "true"
// }

func Test(t *testing.T) {
	// initialize
	old := initialize
	initialize = func(x []float64) {
		for i := range x {
			x[i] = 1.0 //+ float64(i)
		}
	}
	defer func() {
		initialize = old
	}()

	tcs := []struct {
		es   []eigen
		name string
	}{
		{
			name: "simple",
			es: []eigen{
				{𝜦: +2.0, 𝑿: []float64{+0.5714286, +0.1428572, +1.0000000}},
				{𝜦: -5.0, 𝑿: []float64{-0.6666667, -1.0000000, -1.0000000}},
				{𝜦: -1.0, 𝑿: []float64{+0.5773503, +0.5773503, +0.5773503}},
			},
		},
		{
			name: "Матрица 2х2 с одним собственным значением",
			es: []eigen{
				{𝜦: -6.0, 𝑿: []float64{1.0, 0.0}},
				{𝜦: -6.0, 𝑿: []float64{0.0, 1.0}},
			},
		},
		{
			name: "Доминанирование l1 и l2 == l3. Собственные вектора разные",
			es: []eigen{
				{𝜦: -1.0, 𝑿: []float64{0.6, 1.0, 1.0}},
				{𝜦: -5.0, 𝑿: []float64{0.5, 0.2, 1.0}},
				{𝜦: -1.0, 𝑿: []float64{1.0, 1.0, 1.0}},
			},
		},
		{
			name: "Большие числа",
			es: []eigen{
				{𝜦: 1e01, 𝑿: []float64{0.0, 0.0, 0.0, 1.0}},
				{𝜦: 1e04, 𝑿: []float64{0.0, 0.0, 1.0, 0.0}},
				{𝜦: 1e08, 𝑿: []float64{0.0, 1.0, 0.0, 0.0}},
				{𝜦: 1e12, 𝑿: []float64{1.0, 0.0, 0.0, 0.0}},
			},
		},
		{
			name: "Нет доминантной l1 = l2 > 0. Собственные вектора разные",
			es: []eigen{
				{𝜦: +5.0, 𝑿: []float64{0.5, 0.2, 1.0}},
				{𝜦: +5.0, 𝑿: []float64{0.6, 1.0, 1.0}},
				{𝜦: -1.0, 𝑿: []float64{1.0, 1.0, 1.0}},
			},
			//
			// -->[U,I] = spec([-10 1.875 7.125; -15 6.875 7.125; -15 1.875 12.125])
			//  I  =
			//
			//   - 1.    0     0
			//     0     5.    0
			//     0     0     5.
			//  U  =
			//
			//   - 0.5773503    0.3905667  - 0.0576896
			//   - 0.5773503    0.6509446  - 0.9886500
			//   - 0.5773503    0.6509446    0.1387193
			//
		},
		{
			name: "Нет доминантной l1 = l2 < 0. Собственные вектора разные",
			es: []eigen{
				{𝜦: -5.0, 𝑿: []float64{0.5, 0.2, 1.0}},
				{𝜦: -5.0, 𝑿: []float64{0.6, 1.0, 1.0}},
				{𝜦: -1.0, 𝑿: []float64{1.0, 1.0, 1.0}},
			},
			//
			// -->[P,O]=spec([5 -1.25 -4.75; 10 -6.25 -4.75; 10 -1.25 -9.75])
			//  O  =
			//
			//   - 1.    0     0
			//     0   - 5.    0
			//     0     0   - 5.
			//  P  =
			//
			//     0.5773503  - 0.3905667    0.2640036
			//     0.5773503  - 0.6509446  - 0.6377152
			//     0.5773503  - 0.6509446    0.7236169
			//
		},
		// {
		// 	name: "Нет доминантной l1 = l2 > 0. Собственные вектора одинаковые",
		// 	es: []eigen{
		// 		{𝜦: +5.0, 𝑿: []float64{0.6, 0.9, 1.0}},
		// 		{𝜦: -5.0, 𝑿: []float64{0.6, 0.9, 1.0}},
		// 		{𝜦: -1.0, 𝑿: []float64{1.0, 1.0, 1.0}},
		// 	},
		// },
	}

	for _, tc := range tcs {
		t.Run(tc.name, func(t *testing.T) {
			if output {
				fmt.Println(tc.name)
			}

			// generate
			A := generator(tc.es)
			MatrixPrint(A)
			PrintEigens(tc.es)

			// calculate
			e, err := exh(A)
			if err != nil {
				t.Fatal(err)
			}
			PrintEigens(e)

			// compare
			if !compare(e, tc.es) {
				t.Errorf("not same")
			}
		})
	}

	// Output:
}
